04_Simulation/PH_Cases/Mesh_120_by_130/steadyState_2D_Baseline_RANS_SST/0/R
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      R;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
15600
(
(6.6946377e-16 -3.0999369e-16 1.1207885e-39 6.6666667e-16 -0 6.6666667e-16)
(6.4859906e-16 -3.0973663e-16 -1.12053e-39 6.6666667e-16 -0 6.6666667e-16)
(5.8958568e-16 -3.0517087e-16 -5.8346877e-34 6.6666667e-16 -0 6.6666667e-16)
(5.0371873e-16 -2.8779156e-16 -0 6.6666667e-16 -0 6.6666667e-16)
(4.2175505e-16 -2.57117e-16 -2.1613622e-33 6.6666667e-16 -0 6.6666667e-16)
(3.7412709e-16 -2.3089023e-16 2.0732069e-33 6.6666667e-16 -0 6.6666667e-16)
(3.4930301e-16 -2.1386948e-16 -0 6.6666667e-16 -0 6.6666667e-16)
(3.3615995e-16 -2.0367291e-16 -1.9887208e-33 6.6666667e-16 -0 6.6666667e-16)
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    top
    {
        type            fixedValue;
        value           uniform (0 0 -0 0 -0 0);
    }
    hills
    {
        type            fixedValue;
        value           uniform (0 -0 -0 0 -0 0);
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
