04_Simulation/PH_Cases/Mesh_120_by_130/steadyState_2D_Baseline_RANS_SST/0/wallGradU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallGradU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(2.804045 -0 -0)
(2.8026872 -0 -0)
(2.794204 -0 -0)
(2.7725994 -0 -0)
(2.7352453 -0 -0)
(2.6855233 -0 -0)
(2.6295004 -0 -0)
(2.5713555 -0 -0)
...
)
;
    }
    hills
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(2.8040804 -0 -0)
(2.8042062 -0 -0)
(2.8185629 -0 -0)
(2.8877185 -0 -0)
(3.0400521 -0 -0)
(3.1884869 -0 -0)
(3.2751826 -0 -0)
(3.2981072 -0 -0)
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
